GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   初始化记录区数据
   因为是属于固定时间段存储的
   需要记录开始时刻的sector位置(相对的sector偏移)
 */
rt_err_t vdr_init( void )
{
	uint8_t* pbuf;

	pulse_init( ); /*接脉冲计数*/

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

	vdr_08_time = vdr_08_12_init( 8, 0 );
	memset( vdr_08_info, 0xFF, sizeof( vdr_08_info ) );
	vdr_09_time = vdr_08_12_init( 9, 0 );
	vdr_10_time = vdr_08_12_init( 10, 0 );

	rt_sem_release( &sem_dataflash );

/*初始化一个50ms的定时器，用作事故疑点判断*/
	rt_timer_init( &tmr_200ms, "tmr_200ms",     /* 定时器名字是 tmr_50ms */
	               cb_tmr_200ms,                /* 超时时回调的处理函数 */
	               RT_NULL,                     /* 超时函数的入口参数 */
	               RT_TICK_PER_SECOND / 5,      /* 定时长度，以OS Tick为单位 */
	               RT_TIMER_FLAG_PERIODIC );    /* 周期性定时器 */
	rt_timer_start( &tmr_200ms );
}

/*行车记录仪数据采集命令*/
void vdr_rx_8700( uint8_t * pmsg )
{
	uint8_t		* psrc;
	uint8_t		buf[100];
	uint8_t		tmpbuf[32];

	uint16_t	seq = JT808HEAD_SEQ( pmsg );
	uint16_t	len = JT808HEAD_LEN( pmsg );
	uint8_t		cmd = *( pmsg + 12 ); /*跳过前面12字节的头*/
	MYTIME		start, end;
	uint16_t	blocks;
	uint32_t	i;
	uint8_t		fcs;

	switch( cmd )
	{
		case 0x00: /*采集记录仪执行标准版本*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x00\x00\x02\x00\x12\x00", 8, &fcs );
			buf[11] = fcs;
			jt808_tx_ack( 0x0700, buf, 12 );
			break;
		case 0x01:
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x01\x00\x12\x00" "120221123456789\x00\x00\x00\x00", 25, &fcs );
			buf[28] = fcs;
			jt808_tx_ack( 0x0700, buf, 29 );
			break;
		case 0x02: /*行车记录仪时间*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x02\x00\x06\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, gps_baseinfo.datetime, 6, &fcs );
			buf[15] = fcs;
			jt808_tx_ack( 0x0700, buf, 16 );
			break;
		case 0x03:
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x03\x00\x14\x00", 6, &fcs );

			mytime_to_bcd( tmpbuf, mytime_now );            /*实时时间*/
			vdr_pack_buf( buf + 9, tmpbuf, 6, &fcs );

			mytime_to_bcd( tmpbuf, jt808_param.id_0xF030 ); /*首次安装时间*/
			vdr_pack_buf( buf + 15, tmpbuf, 6, &fcs );
			i			= jt808_param.id_0xF032 * 10;       /*初次安装里程 0.1KM BCD码 00-99999999*/
			tmpbuf[0]	= ( ( ( i / 10000000 ) % 10 ) << 4 ) | ( ( i / 1000000 ) % 10 );
			tmpbuf[1]	= ( ( ( i / 100000 ) % 10 ) << 4 ) | ( ( i / 10000 ) % 10 );
			tmpbuf[2]	= ( ( ( i / 1000 ) % 10 ) << 4 ) | ( ( i / 100 ) % 10 );
			tmpbuf[3]	= ( ( ( i / 10 ) % 10 ) << 4 ) | ( i % 10 );
			vdr_pack_buf( buf + 21, tmpbuf, 4, &fcs );
			i			= jt808_param.id_0xF020 * 10;       /*总里程 0.1KM BCD码 00-99999999*/
			tmpbuf[0]	= ( ( ( i / 10000000 ) % 10 ) << 4 ) | ( ( i / 1000000 ) % 10 );
			tmpbuf[1]	= ( ( ( i / 100000 ) % 10 ) << 4 ) | ( ( i / 10000 ) % 10 );
			tmpbuf[2]	= ( ( ( i / 1000 ) % 10 ) << 4 ) | ( ( i / 100 ) % 10 );
			tmpbuf[3]	= ( ( ( i / 10 ) % 10 ) << 4 ) | ( i % 10 );
			vdr_pack_buf( buf + 25, tmpbuf, 4, &fcs );
			buf[29] = fcs;
			jt808_tx_ack( 0x0700, buf, 30 );
			break;
		case 0x04: /*特征系数*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x04\x00\x08\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, gps_baseinfo.datetime, 6, &fcs );
			vdr_pack_word( buf + 15, jt808_param.id_0xF033, &fcs );
			buf[17] = fcs;
			jt808_tx_ack( 0x0700, buf, 18 );
			break;
		case 0x05: /*车辆信息  41byte*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x05\x00\x29\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, jt808_param.id_0xF006, 12, &fcs );
			vdr_pack_buf( buf + 21, "大型汽车    ", 12, &fcs );
			buf[33] = fcs;
			jt808_tx_ack( 0x0700, buf, 34 );
			break;
		case 0x06:                              /*状态信号配置信息 87byte*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x06\x00\x57\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, gps_baseinfo.datetime, 6, &fcs );
			vdr_pack_byte( buf + 15, 1, &fcs ); /*状态信号字节个数*/
			vdr_pack_buf( buf + 16, "用户自定义", 10, &fcs );
			vdr_pack_buf( buf + 26, "用户自定义", 10, &fcs );
			vdr_pack_buf( buf + 36, "用户自定义", 10, &fcs );
			vdr_pack_buf( buf + 46, "近光\0\0\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 56, "远光\0\0\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 66, "右转向\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 76, "左转向\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 86, "制动\0\0\0\0\0\0", 10, &fcs );
			buf[97] = fcs;
			jt808_tx_ack( 0x0700, buf, 98 );
			break;
		case 8:                                 /*08记录*/
		case 9:
		case 0x10:
		case 0x11:
		case 0x12:
			if( len == 1 )                      /*获取所有记录*/
			{
				start	= 0;
				end		= 0xffffffff;
				blocks	= 0;
			}else if( len == 22 )               /*下来的格式 <55><7A><cmd><len(2byte)><保留><data_block(14byte)><XOR>*/
			{
				psrc	= pmsg + 12 + 1 + 7;    /*12字节头+1byte命令字+7字节vdr数据*/
				start	= mytime_from_bcd( psrc );
				end		= mytime_from_bcd( psrc + 6 );
				blocks	= ( *( psrc + 32 ) << 8 ) | ( *( psrc + 33 ) );
			}else
			{
				rt_kprintf( "%d>8700的格式不识别\n", rt_tick_get( ) );
				return;
			}
			vdr_08_12_get_ready( cmd, seq, start, end, blocks );
			break;
		case 0x13:
			break;
		case 0x14:
			break;
		case 0x15:
			break;
		case 0x82:          /*设置车辆信息*/
			if( len == 1 )  /*消息体为空*/
			{
				break;
			}
		case 0x83:          /*设置初次安装日期*/
			break;
		case 0x84:          /*设置状态量配置*/
			break;

		case 0xC2:          /*设置记录仪时间*/
			if( len == 7 )  /*命令字+时间BCD*/
			{
			}
			break;
		case 0xC3:          /*设置脉冲系数*/
			break;
		case 0xC4:          /*设置初始里程*/
			break;
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void vdr_rx_8701( uint8_t * pmsg )
{
}

/************************************** The End Of File **************************************/
